<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
	<title>VisualSubSync : Aide en fran&ccedil;ais</title>
	<meta name="author" content="Christophe Paris">
	<meta name="description" content="Aide de VisualSubSync.">
	<meta http-equiv="content-type" content="text/xml; charset=iso-8859-1">
	<meta name="keywords" content="VisualSubSync, aide, fran&ccedil;ais, french">
	<link rel="icon" href="images/ico16.png" type="image/png">
	<link rel="stylesheet" type="text/css" href="main.css">
</head>
<body>

<div class="MainColumn">

<a href="index.html"><img alt="back to index" class="TopLeftCorner" src="images/ico64.png" border="0"></a>

<div class="MainTitle">Aide de VisualSubSync</div>

<br>

<div class="TitleFR">Pr&eacute;sentation de VisualSubSync (VSS)</div>

VSS est un programme de cr&eacute;ation et d'&eacute;dition de sous-titres visant &agrave; faciliter la synchronisation
des sous-titres. En effet, le logiciel affiche &agrave; la fois le spectre audio et la vid&eacute;o de chacun
de vos projets.<br>
Un mode "network", permet &eacute;galement, par l'interm&eacute;diaire d'une page Web, de soumettre aux
internautes tous vos probl&egrave;mes de sous-titres (par exemple, lorsque la vid&eacute;o que vous sous-titrez
n'est pas dans votre langue maternelle).<br>
<br>
L'interface est intuitive et de nombreuses touches "raccourcies" permettront au d&eacute;butant
comme au n&eacute;ophyte de cr&eacute;er rapidement des vid&eacute;os sous-titr&eacute;es.<br>

<div class="TitleFR">Informations sur le logiciel</div>

<div class="TitleFR1">Licence</div>

VisualSubSync est un logiciel gratuit et open-source. Les sources sont publi&eacute;es sous 
licence GPL (GNU General Public License) dont voici Les Termes et les Conditions G&eacute;n&eacute;rales de Copie,
Distribution et Modification&nbsp;<a href="http://www.april.org/gnu/gpl_french2.html">http://www.april.org/gnu/gpl_french2.html</a>
 ou <a href="gpl_french2.html">ICI</a> pour une copie locale.<br>

<div class="TitleFR1">Syst&egrave;me requis</div>

La version actuelle de VisualSubSync fonctionne sous Windows 98, ME, NT 4.0, 2000 et Xp.<br>
Un navigateur et une connexion Internet sont n&eacute;cessaires pour faire fonctionner le mode "network" (mode r&eacute;seau).<br>
Une souris avec molette est fortement conseill&eacute;e.<br>

<div class="TitleFR1">Fichiers install&eacute;s</div>
Les fichiers install&eacute;s par le logiciel sont les suivants&nbsp;:<br>
<br>
<center>
<table cellspacing="0" cellpadding="2" style="border: 1px solid #aaa; width: 80%;">
	<tr style="background: #ddd;">
		<th style="border-right: 1px solid #aaa; border-bottom: 1px solid #aaa;">Fichiers</th>
		<th style="border-bottom: 1px solid #aaa;">Description</th>
	</tr>
	
	<tr>
		<td><b>.\VisualSubSync</b></td>
		<td>R&eacute;pertoire principal</td>
	</tr>
	<tr>		
		<td style="padding-left: 20px;">
			VisualSubSync.exe<br>
			WavWriter.dll<br>
			VisualSubSync-uninstall.exe
		</td>
		<td>
			Application principale<br>
			Biblioth&egrave;que de l'application principale<br>
			D&eacute;sinstalleur du logiciel
		</td>		
	</tr>	
	
	<tr>
		<td style="border-top: 1px solid #aaa;"><b>.\VisualSubSync\web</b></td>
		<td style="border-top: 1px solid #aaa;">R&eacute;pertoire des fichiers du mode "network"</td>
	</tr>
	<tr>
		<td style="padding-left: 20px;">
			index.shtml<br>
			details.shtml<br>
			send_suggestion.shtml
		</td>
	</tr>	
	<tr>
		<td style="border-top: 1px solid #aaa;"><b>.\VisualSubSync\help<b></td>
		<td style="border-top: 1px solid #aaa;">R&eacute;pertoire des fichiers d'aide</td>
	</tr>
</table>
</center>

<div class="TitleFR">Tutoriel</div>

Ce tutoriel vous permettra, je l'esp&egrave;re, d'utiliser pleinement toutes les fonctions de VSS.<br>

<div class="TitleFR1">Cr&eacute;ation d'un nouveau projet</div>

Ouvrez le logiciel VisualSubSync et s&eacute;lectionnez <i>New Project...</i> dans le menu <i>File</i>.
La fen&ecirc;tre suivante appara&icirc;t&nbsp;:<br>
<br>
<center><img alt="Fen&ecirc;tre de cr&eacute;ation d'un nouveau projet" src="images/T01_01_NewProject.png"></center>
<br>
S&eacute;lectionnez votre vid&eacute;o &agrave; l'aide du bouton (1) (Video source file).<br>
Trois options sont propos&eacute;es dans la zone "Wav file"&nbsp;:<br>
<ul>
	<li>Internal : Il s'agit de l'option par d&eacute;faut. Cochez-la lorsque votre (ou vos) piste(s) audio est multiplex&eacute;e avec la vid&eacute;o,</li>
	<li>External : Cochez cette option lorsque votre fichier audio n'est pas multiplex&eacute; avec la vid&eacute;o. Seuls les fichiers *.wav sont accept&eacute;s.</li>
	<li>Peak file only : Cochez cette option lorsque vous voulez ouvrir un fichier comportant l'extension *.peak.</li>
</ul>

Les champs "Subtitle file" et "Project file" de la fen&ecirc;tre New Project sont remplis automatiquement<br>
Il ne reste plus qu'&agrave; cliquer sur le bouton "Create new project" (3).<br>
La fen&ecirc;tre suivante appara&icirc;t&nbsp;:<br>
<br>
<center><img alt="Extract WAV dialog" src="images/T01_02_ExtractWAV.png"></center>
<br>
Plusieurs r&eacute;glages sont disponibles dans la zone "Settings" :<br>

<i>Stream to extract</i> permet dans le cas d'une vid&eacute;o contenant plusieurs pistes sons,
de s&eacute;lectionner celle qui vous int&eacute;resse. (1)<br>
<br>
Trois modes d'extraction du fichier audio sont possibles (2).<br>
Dans chaque cas, un fichier *.peak sera cr&eacute;&eacute;. Ce dernier contient une version simplifi&eacute;e
du spectre audio n&eacute;cessaire &agrave; la lecture du fichier audio (utiliser directement le fichier
*.wav n&eacute;cessiterait trop de ressources machine).<br>
<br>
Si vous choisissez <i>Only create peak file</i>, la pr&eacute;visualisation du spectre audio se
fera directement gr&acirc;ce au fichier vid&eacute;o. Ce mode est utile lorsqu'on manque de place sur
le disque dur. N&eacute;anmoins, il engendre certains probl&egrave;mes tel qu'un l&eacute;ger temps de chargement
avant la lecture de la piste audio.<br>
L'extraction simple (<i>Simple extraction</i>) d&eacute;compresse le fichier audio sur votre disque
dur (fichier *.wav 16 bit). Attention, la taille du fichier final peut &ecirc;tre relativement importante.<br>
Il est recommand&eacute; d'utiliser le mode <i>Convert to reduce file size</i>. Il cr&eacute;e un fichier wave
de moindre taille, permettant n&eacute;anmoins une &eacute;coute agr&eacute;able.<br>
<br>
Cliquez sur <i>Extract</i> (3) et attendez quelques minutes (2 &agrave; 3 minutes suivant la dur&eacute;e
de votre vid&eacute;o et la puissance de votre processeur).<br>

<div class="TitleFR1">La fen&ecirc;tre principale</div>

<br>
<center><img alt="Main dialog" src="images/T01_03_MainDialog.png"></center>
<br>
L'interface se divise en quatre parties&nbsp;:<br>
(1) La piste audio.<br>
(2) La zone de contr&ocirc;le de l'&eacute;coute audio.<br>
(3) L'ensemble des sous-titres.<br>
(4) La zone d'&eacute;dition des sous-titres. A gauche se trouve un compteur
permettant de conna&icirc;tre le nombre de caract&egrave;res tap&eacute;s par ligne.<br>
<br>
Avant d'expliquer comment cr&eacute;er un sous-titre, nous allons d&eacute;tailler les fonctions de chaque menu.<br>

<div class="TitleFR1">Les menus</div>

<table cellpadding="8">
	<tr>
		<td>
			<center><img alt="File menu" src="images/FileMenu.png"></center>
		</td>
		<td>
			Le menu <i>File</i> permet de cr&eacute;er de nouveau projet (<i>New Project...</i>) &eacute;galement accessible gr&acirc;ce
			au raccourci clavier "Ctrl+N", d'ouvrir d'anciens projets (<i>Open Project...</i>) accessible gr&acirc;ce au
			raccourci clavier "Ctrl+O", d'ouvrir des projets plus r&eacute;cents (<i>Open Recent</i>) ou tout simplement
			de les refermer (<i>Close</i>).<br>
			Il est possible, &agrave; l'aide de la commande <i>Project Properties...</i>, de conna&icirc;tre les emplacements des
			diff&eacute;rents fichiers cr&eacute;&eacute;s &agrave; chaque projet.<br>
			Enfin, vous pouvez sauvegarder votre projet &agrave; l'aide des commandes <i>Save</i> (Ctrl+S) et <i>Save As...</i><br>
			<i>Exit</i> ferme le logiciel.
		</td>
	</tr>
	
	<tr>
		<td>
			<center><img alt="Edit menu" src="images/EditMenu.png"></center>
		</td>
		<td>
			Le menu <i>Edit</i> permet de rechercher un mot contenu dans les sous-titres (<i>Find...</i> ou Ctrl+F),
			d'aller directement &agrave; une ligne de sous-titre ou &agrave; un temps donn&eacute; (<i>Goto</i>), &eacute;galement
			accessible par le raccourci clavier "Ctrl+G".<br>
			Il est aussi possible d'ins&eacute;rer un fichier contenant du texte brut, chaque ligne sera import&eacute;e comme
			un sous-titre, le r&eacute;glage du temps pourra &ecirc;tre fait avec le menu droit de la zone audio <i>Set subtitle time</i>.<br>			
			Les fonctions <i>Error checking</i>, <i>Preferences</i> et <i>Web Server</i> sont respectivement
			expliqu&eacute;es dans les chapitres "Correction des erreurs" et "le mode r&eacute;seau".<br>
			Enfin, <i>Delay</i> (Ctrl+D) permet de d&eacute;caler un ou plusieurs sous-titres.
		</td>
	</tr>

	<tr>
		<td>
			<center><img alt="View menu" src="images/ViewMenu.png"></center>
		</td>
		<td>
			Il est possible de g&eacute;rer le zoom de la fen&ecirc;tre contenant le flux audio gr&acirc;ce au menu <i>View</i>.
			<i>Zoom In</i> permet d'incr&eacute;menter le zoom et <i>Zoom Out</i>, de le d&eacute;cr&eacute;menter.
			Comme son nom l'indique la commande <i>Zoom Selection</i> permet de zoomer une zone s&eacute;lectionn&eacute;e.
			Enfin, <i>Zoom All</i> affiche la totalit&eacute; de la piste audio.<br>
			<i>Show/Hide Video</i>, accessible via la commande clavier F4, ouvre la vid&eacute;o que l'on sous-titre.
		</td>
	</tr>

	<tr>
		<td>
			<center><img alt="View menu" src="images/PlaybackMenu.png"></center>
		</td>
		<td>
			Le menu <i>Playback</i> contient les fonctions de lecture (<i>Play</i> ou F1), d'arr&ecirc;t (<i>Stop</i> ou Esc),
			d'&eacute;coute en boucle (<i>Loop</i> ou F2), d'avance au sous-titre suivant (<i>Next Sub</i> ou F6)
			ou de retour au sous-titre pr&eacute;c&eacute;dent (<i>Previous Sub</i> ou F5).
		</td>
	</tr>

	<tr>
		<td>
			<center><img alt="View menu" src="images/HelpMenu.png"></center>
		</td>
		<td>
			Le menu&nbsp;? contient le fichier d'aide (<i>Help</i>) en anglais, et bient&ocirc;t, je l'esp&egrave;re, celui en fran&ccedil;ais.<br>
			Il contient &eacute;galement le <i>About</i>, ou vous pourrez d&eacute;couvrir la version du logiciel, le nom et l'adresse email
			de l'auteur, ainsi que quelques remerciements.
		</td>
	</tr>
</table>

<div class="TitleFR1">La barre d'outils de la fen&ecirc;tre principale</div>
<br>
<center><img border="1" src="images/ToolBar.png"></center>
<br>
Gr&acirc;ce &agrave; cette barre, un certain nombre de commandes expliqu&eacute;es pr&eacute;c&eacute;demment peut &ecirc;tre effectu&eacute;&nbsp;:<br>
A gauche, les commandes de lecture des sous-titres. Au milieu, les commandes de zoom et de lecture vid&eacute;o.
A droite, l'affichage des erreurs et des suggestions de correction de sous-titres.<br>
<br>
L'<i>auto-scroll WAV display</i> permet d'activer le d&eacute;filement automatique de l'affichage lorsque le curseur
de lecture arrive &agrave; la fin de la fen&ecirc;tre. Il est automatiquement d&eacute;sactiv&eacute; quand on fait d&eacute;filer
la fen&ecirc;tre manuellement.<br>
L'<i>auto-scroll Subtitles</i> permet d'avoir un aper&ccedil;u de la dur&eacute;e des sous-titres. Il maintient
le curseur sur le sous-titre actif.<br>
<br>
Il appara&icirc;t &eacute;galement la position du curseur (au centre, en gras) de la fen&ecirc;tre audio. Ainsi que des
informations comme le d&eacute;but, la fin et la dur&eacute;e de la s&eacute;lection et de la vue courante.<br>

<div class="TitleFR1">Cr&eacute;ation d'un sous-titre</div>

Voici un ensemble de raccourcis &agrave; conna&icirc;tre pour se d&eacute;placer dans la fen&ecirc;tre audio de VSS.<br>
<ul>
<li>Agrandissement/R&eacute;duction centr&eacute; sur le curseur de la souris : molette haut/bas.</li>
<li>Deplacement &agrave; gauche/droite : bouton du milieu enfonc&eacute; + d&eacute;placement &agrave; gauche/droite.</li>
<li>Deplacement rapide &agrave; gauche/droite : touche shift + bouton du milieu enfonc&eacute; + d&eacute;placement &agrave; gauche/droite.</li>
<li>S&eacute;lection : click gauche.</li>
<li>Etendre la s&eacute;lection : touche shift + click gauche.</li>
</ul>

Voici la marche &agrave; suivre pour cr&eacute;er un sous-titre&nbsp;:
<ul>
	<li>Cliquez dans la fen&ecirc;tre contenant le flux audio,</li>
	<li>Zoomez &agrave; l'aide de la mollette de la souris et d&eacute;placez-vous sur la zone que vous voulez sous-titrer &agrave; l'aide &agrave; la scrollbar situ&eacute;e sous la fen&ecirc;tre audio, ou en utilisant le bouton du milieu de la souris</li>
	<li>Jouez la piste audio (F1),</li>
	<li>S&eacute;lectionner la partie du fichier audio que vous voulez sous-titrer en utilisant le clic gauche de la souris,</li>
	<li>V&eacute;rifiez que la partie s&eacute;lectionn&eacute;e et bien celle que vous voulez en la r&eacute;&eacute;coutant (F1). Il est possible de r&eacute;ajuster la s&eacute;lection en maintenant appuy&eacute;e la touche "Shift" de votre clavier en m&ecirc;me temps que le clic gauche de la souris.</li>
</ul>
Ces op&eacute;rations r&eacute;alis&eacute;es, il ne vous reste plus qu'&agrave; utiliser le clic droit
de la souris et &agrave; ajouter un sous-titre (<i>Add Subtitle</i>) (1).<br>
<br>
<center><img alt="Main dialog with the first subtitle" src="images/T01_04_MainDialog2.png"></center>
<br>
On notera que le clic droit de la souris permet aussi d'effacer le sous-titre s&eacute;lectionn&eacute; (<i>Delete Subtitle</i>)
ou de le couper en deux (<i>Split at cursor</i>).<br>
<br>
Il vous suffit maintenant d'&eacute;crire votre sous-titre dans la zone (2). A gauche, le nombre de
caract&egrave;res de chaque ligne de sous-titre est comptabilis&eacute;.<br>
En dessous, se trouve un certain nombre d'information tels que la position du curseur dans
le sous-titre (<i>Line</i> et <i>Column</i>), le nombre total de caract&egrave;res (<i>Total</i>)
du sous-titre et le nombre de caract&egrave;re par seconde (<i>Char/s</i>).
Pour un bon confort visuel lors de la lecture de la vid&eacute;o, il est recommand&eacute; de ne pas
d&eacute;passer 15 &agrave; 20 caract&egrave;res par seconde.<br>
<br>
Nota&nbsp;: lorsque vous ne comprenez pas certains mots ou certaines phrases, compl&eacute;tez votre sous-titre
par des points d'interrogation (???) et faites vous aider par vos amis
gr&acirc;ce &agrave; la fonction "network" de VisualSubSync.<br>

<div class="TitleFR1">Correction des erreurs</div>

Cette commande est accessible par le menu <i>Edit&gt;Error checking&gt;Check errors</i>.<br>
<br>
<center><img alt="Error report" src="images/T01_05_ErrorReport.png"></center>
<br>
Lorsque vous avez terminez de sous-titrer votre vid&eacute;o (ou pendant la phase de sous-titrage),
il est possible de corriger 4 types d'erreurs&nbsp;:<br>
<ul>
<li>Overlapping (chevauchement) : Une erreur est d&eacute;tect&eacute;e lorsque deux sous-titres se chevauchent.</li>
<li>Too short display time (temps trop court) : Une erreur est d&eacute;tect&eacute;e lorsque le nombre de caract&egrave;res par seconde est strictement sup&eacute;rieur &agrave; une valeur d&eacute;finie par l'utilisateur.</li>
<li>Too long display time (temps trop long) : Une erreur est d&eacute;tect&eacute;e lorsque le nombre de caract&egrave;res par seconde est strictement inf&eacute;rieur &agrave; une valeur d&eacute;finie par l'utilisateur.</li>
<li>Too long line (ligne trop longue) : Une erreur est d&eacute;tect&eacute;e lorsque la longueur d'une ligne de sous-titre est strictement sup&eacute;rieur &agrave; une valeur sp&eacute;cifi&eacute;e par l'utilisateur.</li>
</ul>
Double-cliquer sur une ligne, vous d&eacute;place directement sur le sous-titre contenant cette erreur.<br>
<br>
Vous pouvez modifier les trois derniers param&egrave;tres gr&acirc;ce au menu <i>Edit&gt;Preferences...</i><br>

<div class="TitleFR1">Le mode r&eacute;seau (network)</div>

L'originalit&eacute; de ce logiciel tient au fait qu'il int&egrave;gre un mode r&eacute;seau d&eacute;di&eacute; aux personnes
dont la langue maternelle est diff&eacute;rente de la vid&eacute;o originale.<br>
<br>
Pour l'activer, s&eacute;lectionnez le menu <i>Edit&gt;Webserver&gt;Start</i>. Vos amis peuvent ainsi
vous aider &agrave; transcrire un flux audio. Il leurs suffit de taper l'adresse IP (ou le nom de domaine)
de votre ordinateur comme URL dans n'importe quel navigateur.<br>
<br>
Il est &eacute;videmment possible de configurer le port de connexion, si vous utilisez d&eacute;j&agrave; un serveur web,
par l'interm&eacute;diaire du menu <i>Edit&gt;Preferences...</i>. Pour v&eacute;rifier que cela marche ou simplement
voir &agrave; quoi cela ressemble vous pouvez utiliser localement l'adresse <a href="http://127.0.0.1">http://127.0.0.1</a><br>
<br>
<center><img alt="Network mode home page" border="1" src="images/T01_06_HomePage.png"></center>
<br>
En cliquant sur <i>[details]</i> on obtient la page suivante :<br>
<br>
<center><img alt="Details page" src="images/T01_07_DetailsPage.png"></center>
<br>
Vos amis peuvent &eacute;couter le sous-titre en cliquant sur WAV format (1),
proposer des suggestions de mots ou de phrases (2), et envoyer ces suggestions
&agrave; l'aide de la commande <i>Submit</i> (3).<br>
<br>
En retour, vous pourrez afficher les suggestions propos&eacute;es dans VisualSubSync &agrave; l'aide
du menu <i>Edit&gt;Web server&gt;Show suggestions</i>.<br>
Vous devriez alors voir appara&icirc;tre cette fen&ecirc;tre&nbsp;:<br>
<br>
<center><img alt="Suggestions dialog" src="images/T01_08_SuggestionDialog.png"></center>
<br>
Vous pouvez ainsi facilement corriger vos sous-titres.<br>

<div class="TitleFR">FAQ</div>
<p>
<ul>
	<li><b>Comment puis-je visualiser mes sous-titres dans la fen&ecirc;tre "Preview Video"&nbsp;?</b><br>
		Pour ce faire, vous devez, au pr&eacute;alable, avoir install&eacute; VobSub. Dans le fichier de
		configuration de VobSub, cliquez sur l'onglet <i>Misc.</i>, et cochez <i>Auto-reload subtitle
		file after detecting modification</i>. Vous devez &eacute;galement nommer votre fichier sous-titre
		du m&ecirc;me nom que la vid&eacute;o. Par exemple&nbsp;: myvideo.avi et myvideo.srt ou myvideo.FRE.srt.
		Afin de visualiser les derni&egrave;res modifications apport&eacute;es, n'oubliez pas, au pr&eacute;alable,
		d'enregistrer votre fichier sous-titres.	
	</li>
</ul>


<div class="TitleFR">Contact</div>
<p>
Pour tous rapports de bug, suggestions ou id&eacute;es concernant le logiciel&nbsp;:<br>
<a href="http://coreforge.org/tracker/?group_id=29">http://coreforge.org/tracker/?group_id=29</a><br>
<br>
Pour les mises &agrave; jour ou la consultation en ligne des fichiers d'aide&nbsp;:<br>
<a href="http://visualsubsync.com">http://visualsubsync.com</a>&nbsp;-&nbsp;<a href="http://visualsubsync.coreforge.org">http://visualsubsync.coreforge.org</a><br>
<br>
Pour consulter la page du projet VSS&nbsp;:<br>
<a href="http://coreforge.org/projects/visualsubsync">http://coreforge.org/projects/visualsubsync</a><br>
<br>
Rencontrer l'auteur sur irc:<br>
Sur le serveur IRC de CoreCodec : irc.corecodec.com - Channel <a href="irc://irc.corecodec.com/VisualSubSync">#VisualSubSync</a> or 
 <a href="irc://irc.corecodec.com/matroska">#matroska</a> or <a href="irc://irc.corecodec.com/tcmp">#tcmp</a>.
</p>

<br>
<div style="font-size: 80%; text-align: right;">Fichier d'aide &agrave; l'utilisation du logiciel VisualSubSync cr&eacute;&eacute; par St&eacute;phane Saussac.<br>
Tous droits r&eacute;serv&eacute;s.</div><br>

<br>
<a href="index.html">Retour</a>

</div> <!-- MainColumn -->

<script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
</script>
<script type="text/javascript">
_uacct = "UA-793640-3";
urchinTracker("VSS french");
</script>

</body>
</html>